#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.example["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.37.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["coredns"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "coredns"
      + addon_version               = "v1.11.4-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["kube-proxy"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.31.3-eksbuild.2"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_addon.example["vpc-cni"] will be created
  + resource "aws_eks_addon" "example" {
      + addon_name                  = "vpc-cni"
      + addon_version               = "v1.19.2-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "eks-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks will be created
  + resource "aws_eks_cluster" "eks" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "eks-cluster"
        }
      + version                       = "1.31"

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.eks_nodes will be created
  + resource "aws_eks_node_group" "eks_nodes" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "my-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "EKS-NodeGroup-eks-cluster"
        }
      + tags_all               = {
          + "Name" = "EKS-NodeGroup-eks-cluster"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 5
          + min_size     = 2
        }

      + update_config (known after apply)
    }

  # module.eks.aws_launch_template.eks_launch_template will be created
  + resource "aws_launch_template" "eks_launch_template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0de390ef01354cadf"
      + instance_type          = "t2.medium"
      + key_name               = "test"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "eks-launch-template-"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKc2V0IC1vIHh0cmFjZQovZXRjL2Vrcy9ib290c3RyYXAuc2ggZWtzLWNsdXN0ZXIK"
      + vpc_security_group_ids = (known after apply)

      + metadata_options (known after apply)

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "EKS-Node-eks-cluster"
            }
        }
    }

  # module.iam.aws_iam_instance_profile.worker will be created
  + resource "aws_iam_instance_profile" "worker" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "EKS-worker-nodes-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ed-eks-worker"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.autoscaler will be created
  + resource "aws_iam_policy" "autoscaler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ed-eks-autoscaler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.ebs_csi_policy will be created
  + resource "aws_iam_policy" "ebs_csi_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for EBS CSI driver to manage volumes"
      + id               = (known after apply)
      + name             = "EBS_CSI_Policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateVolume",
                          + "ec2:AttachVolume",
                          + "ec2:DeleteVolume",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumeStatus",
                          + "ec2:DescribeVolumeAttribute",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.master will be created
  + resource "aws_iam_role" "master" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EKS-Master"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.worker will be created
  + resource "aws_iam_role" "worker" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ed-eks-worker"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "EKS-Master"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSServicePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "EKS-Master"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "EKS-Master"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore will be created
  + resource "aws_iam_role_policy_attachment" "AmazonSSMManagedInstanceCore" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.autoscaler will be created
  + resource "aws_iam_role_policy_attachment" "autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.ebs_csi_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.s3 will be created
  + resource "aws_iam_role_policy_attachment" "s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "ed-eks-worker"
    }

  # module.iam.aws_iam_role_policy_attachment.x-ray will be created
  + resource "aws_iam_role_policy_attachment" "x-ray" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "ed-eks-worker"
    }

  # module.security_groups.aws_security_group.eks_cluster_sg will be created
  + resource "aws_security_group" "eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane communication with worker nodes"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-cluster-eks-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "eks-cluster-eks-cluster-sg"
        }
      + tags_all               = {
          + "Name" = "eks-cluster-eks-cluster-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group.eks_nodes_sg will be created
  + resource "aws_security_group" "eks_nodes_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for all nodes in the cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-cluster-eks-nodes-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                              = "eks-cluster-eks-nodes-sg"
          + "kubernetes.io/cluster/eks-cluster" = "owned"
        }
      + tags_all               = {
          + "Name"                              = "eks-cluster-eks-nodes-sg"
          + "kubernetes.io/cluster/eks-cluster" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_groups.aws_security_group_rule.eks_cluster_egress_kublet will be created
  + resource "aws_security_group_rule" "eks_cluster_egress_kublet" {
      + description              = "Allow control plane to node egress for kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.eks_cluster_egress_nginx will be created
  + resource "aws_security_group_rule" "eks_cluster_egress_nginx" {
      + description              = "Allow control plane to node egress for nginx"
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.eks_cluster_ingress_nodes will be created
  + resource "aws_security_group_rule" "eks_cluster_ingress_nodes" {
      + description              = "Allow inbound traffic from the worker nodes on the Kubernetes API endpoint port"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_egress_internet will be created
  + resource "aws_security_group_rule" "worker_node_egress_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow outbound internet access"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_kublet will be created
  + resource "aws_security_group_rule" "worker_node_ingress_kublet" {
      + description              = "Allow control plane to node ingress for kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_nginx will be created
  + resource "aws_security_group_rule" "worker_node_ingress_nginx" {
      + description              = "Allow control plane to node ingress for nginx"
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_ingress_ssh will be created
  + resource "aws_security_group_rule" "worker_node_ingress_ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow SSH access to worker nodes"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_tcp will be created
  + resource "aws_security_group_rule" "worker_node_to_worker_node_ingress_coredns_tcp" {
      + description              = "Allow workers nodes to communicate with each other for coredns TCP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_coredns_udp will be created
  + resource "aws_security_group_rule" "worker_node_to_worker_node_ingress_coredns_udp" {
      + description              = "Allow workers nodes to communicate with each other for coredns UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.worker_node_to_worker_node_ingress_ephemeral will be created
  + resource "aws_security_group_rule" "worker_node_to_worker_node_ingress_ephemeral" {
      + description              = "Allow workers nodes to communicate with each other on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_internet_gateway.eks_internet_gateway will be created
  + resource "aws_internet_gateway" "eks_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "eks-cluster-igw"
        }
      + tags_all = {
          + "Name" = "eks-cluster-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "Public Route Table"
        }
      + tags_all         = {
          + "Name" = "Public Route Table"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet_az1_route_table_association will be created
  + resource "aws_route_table_association" "public_subnet_az1_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public_subnet_az2_route_table_association will be created
  + resource "aws_route_table_association" "public_subnet_az2_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet_az1 will be created
  + resource "aws_subnet" "public_subnet_az1" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet AZ1"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet AZ1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public_subnet_az2 will be created
  + resource "aws_subnet" "public_subnet_az2" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet AZ2"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet AZ2"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.eks_vpc will be created
  + resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "eks-cluster-vpc"
        }
      + tags_all                             = {
          + "Name" = "eks-cluster-vpc"
        }
    }

Plan: 42 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ravisrma, Action: `pull_request`*